# repos
tap "adoptopenjdk/openjdk"
tap "holgerbrandl/tap"
tap "wallix/awless"

# system 
cask "alfred"
mas "Amphetamine", id: 937984704
cask "bartender"
cask "daisydisk"
cask "coconutbattery"
brew "exa"
brew "fish"
cask "gpg-suite-no-mail"
brew "htop"
cask "keyboard-maestro"
brew "md5deep"
brew "md5sha1sum"
mas "Moom", id: 419330170
mas "SpeedTest by Ookla", id: 1153157709
brew "tldr"
cask "superduper"
brew "watchexec"
brew "xz"

# Network
brew "dnsmasq"
brew "mtr"
brew "ssh-copy-id"
mas "SonicWall Mobile Connect", id: 822514576
brew "wifi-password"

# general
cask "1Password"
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
cask "dropbox"
cask "google-chrome"
mas "Soulver 2", id: 413965349
cask "transmit"
mas "Tweetbot 2", id: 557168941

# Dev
cask "adoptopenjdk8"
brew "ansible"
brew "awless"
brew "awscli"
cask "aws-vault"
brew "cloc"
brew "direnv"
cask "docker"
brew "dos2unix"
brew "exercism"
brew "flyway"
brew "fzf"
brew "go"
brew "gource"
brew "git"
brew "git-quick-stats"
brew "git-town"
brew "gradle"
brew "graphviz"
brew "httpie"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
brew "jq"
brew "k6"
cask "kaleidoscope"
brew "kotlin"
brew "kscript"
brew "maven"
brew "mysql@5.7", link: true
brew "node"
brew "nodenv"
brew "pyenv"
brew "python3"
brew "rbenv"
brew "rustup"
cask "sampler"
brew "scala"
brew "shellcheck"
brew "starship"
brew "tfenv"
brew "tokei"
cask "Tower"
cask "visual-studio-code"
cask "vmware-fusion"
brew "yamllint"

# Business
cask "agenda"
mas "Bear", id: 1091189122
mas "Deckset", id: 847496013
mas "OmniFocus 3", id: 1346203938
cask "omnigraffle"
mas "MindNode 6", id: 1289197285
mas "Napkin", id: 581789185
mas "Notability", id: 736189492
cask "slack"
cask "timing"

# Photo / Video / Images
mas "Cinemagraph Pro", id: 777874532
mas "GIF Brewery 3", id: 1081413713
cask "screenflow"
cask "sketch"

